MikhaelKaa/firmware-core/firmware/mcu/stm32f407vg/drivers/usb_cdc/usb_cdc.c
/* SPDX-License-Identifier: Apache-2.0 */
/* Copyright 2026 Michael Kaa */

#include <string.h>
#include <errno.h>
#include <stdio.h>

#include "usb_cdc.h"
#include "usb_desc.h"
#include "stm32f407xx.h"

#define USBx USB_OTG_FS
#define USBx_DEVICE ((USB_OTG_DeviceTypeDef *)((uint32_t)USBx + USB_OTG_DEVICE_BASE))
#define USBx_INEP(i) ((USB_OTG_INEndpointTypeDef *)((uint32_t)USBx + USB_OTG_IN_ENDPOINT_BASE + ((i) * 0x20)))
#define USBx_OUTEP(i) ((USB_OTG_OUTEndpointTypeDef *)((uint32_t)USBx + USB_OTG_OUT_ENDPOINT_BASE + ((i) * 0x20)))

// USB Device state
typedef enum {
    USB_STATE_DEFAULT = 0,
    USB_STATE_ADDRESSED,
    USB_STATE_CONFIGURED
} usb_device_state_t;

static usb_device_state_t usb_state = USB_STATE_DEFAULT;

// Buffer sizes
#ifndef USB_CDC_TX_BUFFER_SIZE
#define USB_CDC_TX_BUFFER_SIZE (512U)
#endif

#ifndef USB_CDC_RX_BUFFER_SIZE
#define USB_CDC_RX_BUFFER_SIZE (512U)
#endif

// USB CDC Endpoints
#define CDC_CMD_EP      0x82  // EP2 IN
#define CDC_DATA_IN_EP  0x81  // EP1 IN
#define CDC_DATA_OUT_EP 0x01  // EP1 OUT

// Driver version
const char *dev_usb_cdc_version = "stm32f407vgt6 usb_cdc; PA11-DM, PA12-DP; bare-metal ver 0.0.1";

// Static buffers
static uint8_t tx_buffer[USB_CDC_TX_BUFFER_SIZE];
static volatile uint8_t rx_buffer[USB_CDC_RX_BUFFER_SIZE];

// Ring buffer pointers for RX
static volatile uint32_t rx_read_pos = 0;
static volatile uint32_t rx_write_pos = 0;

// Transfer state
static volatile uint8_t tx_in_progress = 0;
static volatile uint8_t usb_configured = 0;
static volatile uint8_t pending_address = 0;

// Line coding (baudrate, stop bits, parity, data bits)
static struct {
    uint32_t bitrate;
    uint8_t format;    // 0: 1 stop bit, 1: 1.5 stop bits, 2: 2 stop bits
    uint8_t parity;    // 0: None, 1: Odd, 2: Even
    uint8_t data_bits; // 5, 6, 7, 8, 16
} line_coding = {115200, 0, 0, 8};

// Control line state (DTR, RTS)
static volatile uint16_t control_line_state = 0;

// Debug counters
static volatile uint32_t debug_reset_count = 0;
static volatile uint32_t debug_setup_count = 0;
static volatile uint32_t debug_rxflvl_count = 0;
static volatile uint32_t debug_address_set = 0;
static volatile uint32_t debug_ep0_in_xfrc = 0;
static volatile uint32_t debug_multi_packet = 0;
static volatile uint16_t debug_last_total = 0;
static volatile uint16_t debug_last_sent = 0;
static volatile uint16_t debug_just_sent = 0;
static volatile uint16_t debug_last_wLength = 0;
static volatile uint32_t debug_xfrc_with_state1 = 0;
static volatile uint32_t debug_get_config_desc = 0;
static volatile uint32_t debug_config_wlen9 = 0;
static volatile uint32_t debug_config_wlen67 = 0;
static volatile uint8_t debug_last_ep0_state = 0;  // ep0_state at last XFRC  // Config requests with wLen=67  // Config requests with wLen=9

// Callback for RX data
static void (*usb_cdc_rx_callback)(void) = NULL;

// SETUP packet buffer
static uint8_t setup_packet[8];
static uint8_t last_setup_packet[8]; // For debugging
static uint8_t setup_history[5][8] = {0};  // Last 5 SETUP packets
static uint8_t setup_hist_idx = 0;

// EP0 state
static uint8_t ep0_state = 0; // 0=IDLE, 1=DATA_IN, 2=DATA_OUT, 3=STATUS_IN, 4=STATUS_OUT
static const uint8_t *ep0_tx_ptr = NULL;
static uint16_t ep0_tx_len = 0;
static uint16_t ep0_tx_total = 0;  // Total bytes to send
static uint16_t ep0_tx_sent = 0;   // Bytes already sent

// Open endpoint
static void usb_ep_open(uint8_t ep_addr, uint8_t ep_type, uint16_t ep_mps) {
    uint8_t ep_num = ep_addr & 0x7F;
    uint8_t is_in = (ep_addr & 0x80) != 0;
    
    if (is_in) {
        USBx_DEVICE->DAINTMSK |= (1 << ep_num);
        USBx_INEP(ep_num)->DIEPCTL = (ep_mps & 0x7FF) | 
                                      (ep_type << 18) | 
                                      (ep_num << 22) |
                                      USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                      USB_OTG_DIEPCTL_USBAEP;
    } else {
        USBx_DEVICE->DAINTMSK |= (1 << (ep_num + 16));
        USBx_OUTEP(ep_num)->DOEPCTL = (ep_mps & 0x7FF) | 
                                       (ep_type << 18) |
                                       USB_OTG_DOEPCTL_SD0PID_SEVNFRM |
                                       USB_OTG_DOEPCTL_USBAEP;
    }
}

// Write to TX FIFO
static void usb_write_fifo(uint8_t ep_num, const uint8_t *src, uint16_t len) {
    uint32_t count32 = (len + 3) / 4;
    __IO uint32_t *fifo = (__IO uint32_t *)((uint32_t)USBx + 0x1000 * (ep_num + 1));
    
    for (uint32_t i = 0; i < count32; i++) {
        uint32_t data = 0;
        for (int j = 0; j < 4 && (i * 4 + j) < len; j++) {
            data |= ((uint32_t)src[i * 4 + j]) << (j * 8);
        }
        *fifo = data;
    }
}

// Read from RX FIFO
static void usb_read_fifo(uint8_t *dest, uint16_t len) {
    uint32_t count32 = (len + 3) / 4;
    __IO uint32_t *fifo = (__IO uint32_t *)((uint32_t)USBx + 0x1000);
    
    for (uint32_t i = 0; i < count32; i++) {
        uint32_t data = *fifo;
        for (int j = 0; j < 4 && (i * 4 + j) < len; j++) {
            dest[i * 4 + j] = (data >> (j * 8)) & 0xFF;
        }
    }
}

// EP0 transmit
static void usb_ep0_transmit(const uint8_t *data, uint16_t len) {
    uint16_t pkt = (len > 64) ? 64 : len;
    
    ep0_tx_ptr = (uint8_t *)data;
    ep0_tx_total = len;
    ep0_tx_sent = 0;
    ep0_state = 1;
    
    USBx_INEP(0)->DIEPTSIZ = (1 << 19) | pkt;
    USBx_INEP(0)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
    
    if (pkt > 0) {
        usb_write_fifo(0, data, pkt);
    }
}

// Handle standard device requests
static void usb_handle_setup(void) {
    debug_setup_count++;
    memcpy(last_setup_packet, setup_packet, 8);
    memcpy(setup_history[setup_hist_idx], setup_packet, 8);
    setup_hist_idx = (setup_hist_idx + 1) % 5;
    
    // Reset EP0 state
    ep0_state = 0;
    ep0_tx_ptr = NULL;
    ep0_tx_len = 0;
    
    uint8_t req_type = setup_packet[0];
    uint8_t req = setup_packet[1];
    uint16_t wValue = setup_packet[2] | (setup_packet[3] << 8);
    uint16_t wLength = setup_packet[6] | (setup_packet[7] << 8);
    
