MikhaelKaa/firmware-core/firmware/mcu/stm32f407vg/drivers/usb_cdc/usb_cdc.c
    if ((req_type & 0x60) == 0x00) { // Standard request
        if (req == USB_REQ_GET_DESCRIPTOR) {
            uint8_t desc_type = wValue >> 8;
            uint8_t desc_index = wValue & 0xFF;
            
            if (desc_type == USB_DESC_TYPE_DEVICE) {
                usb_ep0_transmit(usb_device_desc, (wLength < 18) ? wLength : 18);
            } else if (desc_type == USB_DESC_TYPE_CONFIGURATION) {
                debug_get_config_desc++;
                if (wLength == 9) {
                    debug_config_wlen9++;
                } else if (wLength >= 67) {
                    debug_config_wlen67++;
                }
                debug_last_wLength = wLength;
                uint16_t len = (wLength < 67) ? wLength : 67;
                debug_last_total = len;
                usb_ep0_transmit(usb_config_desc, len);
            } else if (desc_type == USB_DESC_TYPE_STRING) {
                if (desc_index < usb_string_desc_count) {
                    uint8_t len = usb_string_desc[desc_index][0];
                    usb_ep0_transmit(usb_string_desc[desc_index], (wLength < len) ? wLength : len);
                }
            } else if (desc_type == 0x06) { // DEVICE_QUALIFIER - not supported for FS-only device
                // STALL EP0
                USBx_INEP(0)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
            }
        } else if (req == USB_REQ_SET_ADDRESS) {
            uint8_t addr = wValue & 0x7F;
            // Set address immediately (before status stage)
            USBx_DEVICE->DCFG = (USBx_DEVICE->DCFG & ~USB_OTG_DCFG_DAD) | (addr << 4);
            usb_state = (addr != 0) ? USB_STATE_ADDRESSED : USB_STATE_DEFAULT;
            debug_address_set++;
            usb_ep0_transmit(NULL, 0); // Status stage
        } else if (req == USB_REQ_SET_CONFIGURATION) {
            usb_configured = 1;
            usb_state = USB_STATE_CONFIGURED;
            usb_ep0_transmit(NULL, 0); // Status stage
        } else {
            usb_ep0_transmit(NULL, 0); // ACK
        }
    } else if ((req_type & 0x60) == 0x20) { // Class request
        if (req == CDC_SET_LINE_CODING) {
            // Will receive 7 bytes in DATA stage
            ep0_state = 2; // DATA_OUT
            USBx_OUTEP(0)->DOEPTSIZ = (1 << 19) | 7;
            USBx_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
        } else if (req == CDC_GET_LINE_CODING) {
            uint8_t coding[7] = {0x00, 0xC2, 0x01, 0x00, 0, 0, 8}; // 115200, 1 stop, no parity, 8 bits
            usb_ep0_transmit(coding, 7);
        } else if (req == CDC_SET_CONTROL_LINE_STATE) {
            control_line_state = wValue;
            usb_ep0_transmit(NULL, 0); // ACK
        } else {
            usb_ep0_transmit(NULL, 0); // ACK
        }
    }
}

static int usb_cdc_available(void);

// USB soft disconnect/reconnect via PC9 (D+ pull-up control)
static void usb_soft_disconnect(void) {
    GPIOC->BSRR = GPIO_BSRR_BR9;  // Reset PC9 (disable pull-up)
}

static void usb_soft_reconnect(void) {
    GPIOC->BSRR = GPIO_BSRR_BS9;  // Set PC9 (enable pull-up)
}

// USB Core initialization
static void usb_core_init(void) {
    // Core soft reset
    USBx->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
    while (USBx->GRSTCTL & USB_OTG_GRSTCTL_CSRST);
    
    // Wait for AHB idle
    while (!(USBx->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL));
    
    // Deactivate power down and disable VBUS sensing
    USBx->GCCFG = USB_OTG_GCCFG_PWRDWN | USB_OTG_GCCFG_NOVBUSSENS;
    
    // Force device mode, select embedded FS PHY
    USBx->GUSBCFG = USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL;
    
    // USB turnaround time for 48MHz
    USBx->GUSBCFG &= ~(0xFUL << 10);
    USBx->GUSBCFG |= (0x6 << 10);
    
    // Wait 50ms for mode switch
    for (volatile int i = 0; i < 500000; i++);
}

// USB Device initialization
static void usb_device_init(void) {
    // Soft disconnect first
    USBx_DEVICE->DCTL |= USB_OTG_DCTL_SDIS;
    
    // Device speed: Full Speed
    USBx_DEVICE->DCFG |= USB_OTG_DCFG_DSPD;
    
    // Flush FIFOs
    USBx->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (0x10 << 6);
    while (USBx->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
    
    USBx->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
    while (USBx->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH);
    
    // Clear interrupts
    USBx_DEVICE->DIEPMSK = 0;
    USBx_DEVICE->DOEPMSK = 0;
    USBx_DEVICE->DAINT = 0xFFFFFFFF;
    USBx_DEVICE->DAINTMSK = 0;
    
    for (int i = 0; i < 4; i++) {
        USBx_INEP(i)->DIEPINT = 0xFF;
        USBx_OUTEP(i)->DOEPINT = 0xFF;
    }
    
    // Configure FIFOs
    // RX FIFO: 128 words
    USBx->GRXFSIZ = 128;
    
    // TX0 FIFO: 64 words at offset 128
    USBx->DIEPTXF0_HNPTXFSIZ = (64 << 16) | 128;
    
    // TX1 FIFO: 64 words at offset 192
    USBx->DIEPTXF[0] = (64 << 16) | 192;
    
    // TX2 FIFO: 16 words at offset 256 (for EP3 interrupt)
    USBx->DIEPTXF[1] = (16 << 16) | 256;
    
    // TX2 FIFO: 16 words at offset 256 (for EP3 interrupt)
    USBx->DIEPTXF[1] = (16 << 16) | 256;
    
    // Enable interrupts
    USBx->GINTMSK = USB_OTG_GINTMSK_USBRST | 
                    USB_OTG_GINTMSK_ENUMDNEM |
                    USB_OTG_GINTMSK_RXFLVLM |
                    USB_OTG_GINTMSK_IEPINT |
                    USB_OTG_GINTMSK_OEPINT;
    
    // Enable global interrupt
    USBx->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
    
    // Clear global interrupt status
    USBx->GINTSTS = 0xFFFFFFFF;
    
    // Soft connect (enable pull-up on D+)
    USBx_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS;
}

// Initialize USB peripheral
static int usb_cdc_init(void) {
    // Enable clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
    RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
    
    // Configure GPIO for USB OTG FS (PA11 - DM, PA12 - DP)
    GPIOA->MODER &= ~(GPIO_MODER_MODER11 | GPIO_MODER_MODER12);
    GPIOA->MODER |= (2 << GPIO_MODER_MODER11_Pos) | (2 << GPIO_MODER_MODER12_Pos);
    
    // Alternate function AF10 for USB OTG FS
    GPIOA->AFR[1] &= ~(GPIO_AFRH_AFSEL11 | GPIO_AFRH_AFSEL12);
    GPIOA->AFR[1] |= (10 << (4 * 3)) | (10 << (4 * 4));
    
