MikhaelKaa/firmware-core/firmware/mcu/stm32f407vg/drivers/usb_cdc/usb_cdc.c
    // Very high speed
    GPIOA->OSPEEDR |= (3 << GPIO_OSPEEDR_OSPEED11_Pos) | (3 << GPIO_OSPEEDR_OSPEED12_Pos);
    
    // No pull-up/pull-down
    GPIOA->PUPDR &= ~(GPIO_PUPDR_PUPD11 | GPIO_PUPDR_PUPD12);
    
    // PC9 as output for D+ pull-up control (1.5k to D+)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    GPIOC->MODER &= ~GPIO_MODER_MODER9;
    GPIOC->MODER |= (1 << GPIO_MODER_MODER9_Pos);  // Output
    GPIOC->BSRR = GPIO_BSRR_BS9;  // Set high (enable pull-up)
    
    // Initialize USB core and device
    usb_core_init();
    usb_device_init();
    
    // Enable USB interrupt
    NVIC_EnableIRQ(OTG_FS_IRQn);
    
    // Clear buffers
    memset((void *)tx_buffer, 0, USB_CDC_TX_BUFFER_SIZE);
    memset((void *)rx_buffer, 0, USB_CDC_RX_BUFFER_SIZE);
    
    usb_configured = 0;
    usb_state = USB_STATE_DEFAULT;
    
    return 0;
}

// Deinitialize USB
static int usb_cdc_deinit(void) {
    // Disable USB
    NVIC_DisableIRQ(OTG_FS_IRQn);
    RCC->AHB2ENR &= ~RCC_AHB2ENR_OTGFSEN;
    
    usb_configured = 0;
    return 0;
}

// Write data to USB CDC
static int usb_cdc_write(const void *buf, size_t count) {
    if (buf == NULL || count == 0) {
        return -EINVAL;
    }
    
    if (!usb_configured) {
        return -ENOTCONN;
    }
    
    if (count > USB_CDC_TX_BUFFER_SIZE) {
        count = USB_CDC_TX_BUFFER_SIZE;
    }

    // Wait for previous transmission to complete
    uint32_t timeout = 10000000;
    while (tx_in_progress && timeout--) {
        __asm__("nop");
    }
    
    if (timeout == 0) {
        return -ETIMEDOUT;
    }
    
    // Copy data to buffer
    memcpy(tx_buffer, buf, count);
    tx_in_progress = 1;
    
    // Start transmission on EP1 IN
    USBx_INEP(1)->DIEPTSIZ = (1 << 19) | count;
    USBx_INEP(1)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
    
    usb_write_fifo(1, tx_buffer, count);
    
    return (int)count;
}

// Read data from USB CDC
static int usb_cdc_read(void *buf, size_t count) {
    if (buf == NULL) {
        return -EINVAL;
    }
    
    uint8_t *buffer = (uint8_t *)buf;
    size_t bytes_read = 0;
    
    int available = usb_cdc_available();
    if (available == 0) {
        return 0;
    }
    
    if (count > (size_t)available) {
        count = (size_t)available;
    }
    
    // Read data from ring buffer
    for (size_t i = 0; i < count; i++) {
        buffer[i] = rx_buffer[rx_read_pos];
        rx_read_pos = (rx_read_pos + 1) % USB_CDC_RX_BUFFER_SIZE;
        bytes_read++;
    }
    
    return (int)bytes_read;
}

// Check how many bytes are available to read
static int usb_cdc_available(void) {
    int available = (int)((rx_write_pos - rx_read_pos + USB_CDC_RX_BUFFER_SIZE) % USB_CDC_RX_BUFFER_SIZE);
    return available;
}

// IO Control for USB CDC
static int usb_cdc_ioctl(int cmd, void *arg) {
    switch (cmd) {
        case INTERFACE_INIT:
            return usb_cdc_init();

        case INTERFACE_DEINIT:
            return usb_cdc_deinit();

        case USB_CDC_GET_AVAILABLE:
            if (arg != NULL) {
                *(int *)arg = usb_cdc_available();
            }
            return 0;

        case INTERFACE_GET_INFO:
            if (arg != NULL) {
                *(const char **)arg = dev_usb_cdc_version;
                return 0;
            }
            return -EINVAL;

        case USB_CDC_SET_RX_CALLBACK:
            {
                union {
                    void (*func)(void);
                    void *ptr;
                } cast;
                cast.ptr = arg;
                usb_cdc_rx_callback = cast.func;
            }
            return 0;

        case USB_CDC_GET_DTR:
            if (arg != NULL) {
                *(uint8_t *)arg = (control_line_state & 0x01) ? 1 : 0;
            }
            return 0;

        case USB_CDC_GET_RTS:
            if (arg != NULL) {
                *(uint8_t *)arg = (control_line_state & 0x02) ? 1 : 0;
            }
            return 0;

        case USB_CDC_GET_DEBUG_STATS:
            if (arg != NULL) {
                usb_cdc_debug_stats_t *stats = (usb_cdc_debug_stats_t *)arg;
                stats->reset_count = debug_reset_count;
                stats->setup_count = debug_setup_count;
                stats->rxflvl_count = debug_rxflvl_count;
                stats->address_set = debug_address_set;
                stats->ep0_in_xfrc = debug_ep0_in_xfrc;
                stats->multi_packet = debug_multi_packet;
                stats->last_total = debug_last_total;
                stats->last_sent = debug_last_sent;
                stats->just_sent = debug_just_sent;
                stats->last_wLength = debug_last_wLength;
                stats->xfrc_with_state1 = debug_xfrc_with_state1;
                stats->get_config_desc = debug_get_config_desc;
                stats->config_wlen9 = debug_config_wlen9;
                stats->config_wlen67 = debug_config_wlen67;
                stats->last_ep0_state = debug_last_ep0_state;
                memcpy(stats->last_setup, last_setup_packet, 8);
                memcpy(stats->setup_hist, setup_history, sizeof(setup_history));
            }
            return 0;

        case USB_CDC_SOFT_DISCONNECT:
            usb_soft_disconnect();
            return 0;

        case USB_CDC_SOFT_RECONNECT:
            usb_soft_reconnect();
            return 0;

        default:
            return -ENOTSUP;
    }
}

// USB CDC device instance
const drv_face_t dev_usb_cdc = {
    .read = usb_cdc_read, 
    .write = usb_cdc_write, 
    .ioctl = usb_cdc_ioctl
};

const drv_face_t* dev_usb_cdc_get(void)
{
    return (const drv_face_t*) &dev_usb_cdc;
}

// USB OTG FS Interrupt Handler
void OTG_FS_IRQHandler(void) {
    uint32_t gintsts = USBx->GINTSTS;
    
    // USB Reset
    if (gintsts & USB_OTG_GINTSTS_USBRST) {
        USBx->GINTSTS = USB_OTG_GINTSTS_USBRST;
        debug_reset_count++;
        
        // Reset device state
        usb_state = USB_STATE_DEFAULT;
        usb_configured = 0;
        ep0_state = 0;
        pending_address = 0;
        
        // Clear all interrupts
        USBx->GINTSTS = 0xFFFFFFFF;
        
        // Set device address to 0
        USBx_DEVICE->DCFG &= ~USB_OTG_DCFG_DAD;
        
        // Flush FIFOs
        USBx->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (0x10 << 6);
        while (USBx->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
        
        USBx->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
        while (USBx->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH);
        
