MikhaelKaa/firmware-core/firmware/mcu/stm32f407vg/drivers/usb_cdc/usb_cdc.c
        // Enable endpoint interrupts for EP0, EP1
        USBx_DEVICE->DAINTMSK = 0x30003; // EP0 IN/OUT, EP1 IN/OUT, EP3 IN
        USBx_DEVICE->DOEPMSK = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM;
        USBx_DEVICE->DIEPMSK = USB_OTG_DIEPMSK_XFRCM;
        
        // Open EP0
        USBx_INEP(0)->DIEPCTL = USB_OTG_DIEPCTL_USBAEP | USB_OTG_DIEPCTL_SNAK;
        USBx_OUTEP(0)->DOEPCTL = USB_OTG_DOEPCTL_USBAEP;
        
        // Prepare EP0 OUT for SETUP
        USBx_OUTEP(0)->DOEPTSIZ = (3 << 29) | (1 << 19) | 64;
        USBx_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;
        
        // Open EP1 IN (Bulk)
        USBx_INEP(1)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
                                 (1 << 22) | // TX FIFO 1
                                 (2 << 18) | // Bulk
                                 USB_OTG_DIEPCTL_USBAEP |
                                 64;
        
        // Open EP1 OUT (Bulk)
        USBx_OUTEP(1)->DOEPCTL = USB_OTG_DOEPCTL_CNAK |
                                  (2 << 18) | // Bulk
                                  USB_OTG_DOEPCTL_USBAEP |
                                  64;
        
        USBx_OUTEP(1)->DOEPTSIZ = (1 << 19) | 64;
        USBx_OUTEP(1)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA;
        
        // Open EP3 IN (Interrupt)
        USBx_INEP(3)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
                                 (2 << 22) | // TX FIFO 2
                                 (3 << 18) | // Interrupt
                                 USB_OTG_DIEPCTL_USBAEP |
                                 8;
    }
    
    // Enumeration done
    if (gintsts & USB_OTG_GINTSTS_ENUMDNE) {
        USBx->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;
        
        // Set EP0 max packet size to 64
        USBx_INEP(0)->DIEPCTL &= ~USB_OTG_DIEPCTL_MPSIZ;
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_CGINAK;
        return;
    }
    
    // RX FIFO non-empty - MUST be processed first
    if (gintsts & USB_OTG_GINTSTS_RXFLVL) {
        debug_rxflvl_count++;
        uint32_t grxsts = USBx->GRXSTSP;
        uint8_t epnum = grxsts & 0xF;
        uint16_t count = (grxsts >> 4) & 0x7FF;
        uint8_t pktsts = (grxsts >> 17) & 0xF;
        
        if (pktsts == 6 && epnum == 0) { // SETUP packet data in FIFO
            usb_read_fifo(setup_packet, 8);
            usb_handle_setup(); // Handle immediately
        } else if (pktsts == 2 && count > 0) { // OUT packet
            if (epnum == 1) {
                // EP1 OUT - CDC data
                uint8_t temp[64];
                usb_read_fifo(temp, count);
                
                // Copy to ring buffer
                for (uint16_t i = 0; i < count; i++) {
                    rx_buffer[rx_write_pos] = temp[i];
                    rx_write_pos = (rx_write_pos + 1) % USB_CDC_RX_BUFFER_SIZE;
                }
                
                if (usb_cdc_rx_callback) {
                    usb_cdc_rx_callback();
                }
            }
        }
        // Don't return - continue to process OEPINT
    }
    
    // OUT endpoint interrupt - process before IN
    if (gintsts & USB_OTG_GINTSTS_OEPINT) {
        USBx->GINTSTS = USB_OTG_GINTSTS_OEPINT;
        uint32_t ep_intr = (USBx_DEVICE->DAINT >> 16) & 0xFFFF;
        
        if (ep_intr & 0x1) { // EP0 OUT
            uint32_t doepint = USBx_OUTEP(0)->DOEPINT;
            
            if (doepint & USB_OTG_DOEPINT_STUP) {
                // SETUP packet received
                usb_handle_setup();
                USBx_OUTEP(0)->DOEPINT = USB_OTG_DOEPINT_STUP;
                // Prepare for next SETUP
                USBx_OUTEP(0)->DOEPTSIZ = (3 << 29) | (1 << 19) | 64;
                USBx_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
            }
            
            if (doepint & USB_OTG_DOEPINT_XFRC) {
                USBx_OUTEP(0)->DOEPINT = USB_OTG_DOEPINT_XFRC;
                // Prepare EP0 OUT for next SETUP
                USBx_OUTEP(0)->DOEPTSIZ = (3 << 29) | (1 << 19) | 64;
                USBx_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
            }
        }
        
        if (ep_intr & 0x2) { // EP1 OUT
            uint32_t doepint = USBx_OUTEP(1)->DOEPINT;
            
            if (doepint & USB_OTG_DOEPINT_XFRC) {
                USBx_OUTEP(1)->DOEPINT = USB_OTG_DOEPINT_XFRC;
                
                // Re-enable for next reception
                USBx_OUTEP(1)->DOEPTSIZ = (1 << 19) | 64;
                USBx_OUTEP(1)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
            }
        }
        return;
    }
    
    // IN endpoint interrupt
    if (gintsts & USB_OTG_GINTSTS_IEPINT) {
        USBx->GINTSTS = USB_OTG_GINTSTS_IEPINT;
        uint32_t ep_intr = USBx_DEVICE->DAINT & 0xFFFF;
        
        if (ep_intr & 0x1) { // EP0 IN
            uint32_t diepint = USBx_INEP(0)->DIEPINT;
            
            if (diepint & USB_OTG_DIEPINT_XFRC) {
                USBx_INEP(0)->DIEPINT = USB_OTG_DIEPINT_XFRC;
                debug_ep0_in_xfrc++;
                debug_last_ep0_state = ep0_state;
                
                // Update pointer after sending
                if (ep0_state == 1) {
                    debug_xfrc_with_state1++;
                    uint16_t just_sent = (ep0_tx_total - ep0_tx_sent > 64) ? 64 : (ep0_tx_total - ep0_tx_sent);
                    debug_just_sent = just_sent;
                    ep0_tx_sent += just_sent;
                    uint16_t remaining = ep0_tx_total - ep0_tx_sent;
                    
                    if (remaining > 0) {
                        // Send next chunk
                        debug_multi_packet++;
                        debug_last_total = ep0_tx_total;
                        debug_last_sent = ep0_tx_sent;
                        uint16_t pkt = (remaining > 64) ? 64 : remaining;
                        
                        USBx_INEP(0)->DIEPTSIZ = (1 << 19) | pkt;
                        USBx_INEP(0)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
                        usb_write_fifo(0, ep0_tx_ptr + ep0_tx_sent, pkt);
                    } else {
                        ep0_state = 0;
                        // Prepare EP0 OUT
                        USBx_OUTEP(0)->DOEPTSIZ = (3 << 29) | (1 << 19) | 64;
                        USBx_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
                    }
                } else {
                    ep0_state = 0;
                    // Prepare EP0 OUT for next SETUP
                    USBx_OUTEP(0)->DOEPTSIZ = (3 << 29) | (1 << 19) | 64;
                    USBx_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
                }
            }
        }
        
        if (ep_intr & 0x2) { // EP1 IN
            uint32_t diepint = USBx_INEP(1)->DIEPINT;
            
            if (diepint & USB_OTG_DIEPINT_XFRC) {
                USBx_INEP(1)->DIEPINT = USB_OTG_DIEPINT_XFRC;
                tx_in_progress = 0;
            }
        }
        return;
    }
}
